In [ ]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline 
import seaborn as sns

pd.pandas.set_option('display.max_columns',None)

In [ ]:
df=pd.read_csv('/content/train_data - train_data.csv')

In [ ]:
df_new=df.copy()

In [ ]:
df.shape

(3499, 13)

In [ ]:
df.head()

,Name,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,New_Price,Price
0,Maruti Wagon R LXI CNG,Mumbai,2010,72000,CNG,Manual,First,26.6 km/kg,998 CC,58.16 bhp,5.0,NaN,1.75
1,Hyundai Creta 1.6 CRDi SX Option,Pune,2015,41000,Diesel,Manual,First,19.67 kmpl,1582 CC,126.2 bhp,5.0,NaN,12.50
2,Honda Jazz V,Chennai,2011,46000,Petrol,Manual,First,18.2 kmpl,1199 CC,88.7 bhp,5.0,8.61 Lakh,4.50
3,Maruti Ertiga VDI,Chennai,2012,87000,Diesel,Manual,First,20.77 kmpl,1248 CC,88.76 bhp,7.0,NaN,6.00
4,Audi A4 New 2.0 TDI Multitronic,Coimbatore,2013,40670,Diesel,Automatic,Second,15.2 kmpl,1968 CC,140.8 bhp,5.0,NaN,17.74

In [ ]:
df.isnull().sum()

Name                    0
Location                0
Year                    0
Kilometers_Driven       0
Fuel_Type               0
Transmission            0
Owner_Type              0
Mileage                 0
Engine                 22
Power                  22
Seats                  25
New_Price            3018
Price                   0
dtype: int64

In [ ]:
df_new['Power'] = df_new['Power'].replace('bhp','', regex=True)
df_new['Engine'] = df_new['Engine'].replace('CC','',regex=True)
df_new['Mileage'] = df_new['Mileage'].replace('kmpl','', regex=True)
df_new['Mileage'] = df_new['Mileage'].replace('km/kg','', regex=True)
df_new['Power']=pd.to_numeric(df_new['Power'],downcast='integer',errors='coerce')
df_new['Engine']=pd.to_numeric(df_new['Engine'],downcast='integer',errors='coerce')
df_new['Mileage']=pd.to_numeric(df_new['Mileage'],downcast='integer',errors='coerce')

In [ ]:
df_new.head()

,Name,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,New_Price,Price
0,Maruti Wagon R LXI CNG,Mumbai,2010,72000,CNG,Manual,First,26.60,998.0,58.16,5.0,NaN,1.75
1,Hyundai Creta 1.6 CRDi SX Option,Pune,2015,41000,Diesel,Manual,First,19.67,1582.0,126.20,5.0,NaN,12.50
2,Honda Jazz V,Chennai,2011,46000,Petrol,Manual,First,18.20,1199.0,88.70,5.0,8.61 Lakh,4.50
3,Maruti Ertiga VDI,Chennai,2012,87000,Diesel,Manual,First,20.77,1248.0,88.76,7.0,NaN,6.00
4,Audi A4 New 2.0 TDI Multitronic,Coimbatore,2013,40670,Diesel,Automatic,Second,15.20,1968.0,140.80,5.0,NaN,17.74

In [ ]:

df_new.isnull().sum()

Name                    0
Location                0
Year                    0
Kilometers_Driven       0
Fuel_Type               0
Transmission            0
Owner_Type              0
Mileage                 0
Engine                 22
Power                  87
Seats                  25
New_Price            3018
Price                   0
dtype: int64

In [ ]:
df_new.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3499 entries, 0 to 3498
Data columns (total 13 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Name               3499 non-null   object
 1   Location           3499 non-null   object
 2   Year               3499 non-null   int64
 3   Kilometers_Driven  3499 non-null   int64
 4   Fuel_Type          3499 non-null   object
 5   Transmission       3499 non-null   object
 6   Owner_Type         3499 non-null   object
 7   Mileage            3499 non-null   float64
 8   Engine             3477 non-null   float64
 9   Power              3412 non-null   float64
 10  Seats              3474 non-null   float64
 11  New_Price          481 non-null    object
 12  Price              3499 non-null   float64
dtypes: float64(5), int64(2), object(6)
memory usage: 355.5+ KB

In [ ]:
df_new.describe()

,Year,Kilometers_Driven,Mileage,Engine,Power,Seats,Price
count,3499.000000,3.499000e+03,3499.000000,3477.000000,3412.000000,3474.000000,3499.000000
mean,2013.373821,5.979420e+04,18.083587,1622.228645,113.527953,5.291307,9.605247
std,3.223566,1.160794e+05,4.598651,589.668709,53.135671,0.824893,11.250112
min,1998.000000,1.710000e+02,0.000000,624.000000,34.200000,2.000000,0.440000
25%,2011.000000,3.400000e+04,15.100000,1198.000000,76.975000,5.000000,3.500000
50%,2014.000000,5.344200e+04,18.160000,1493.000000,94.000000,5.000000,5.650000
75%,2016.000000,7.303650e+04,21.020000,1991.000000,140.000000,5.000000,10.250000
max,2019.000000,6.500000e+06,33.540000,5461.000000,550.000000,10.000000,97.070000

In [ ]:
df_new['Brand']=df_new['Name'].apply(lambda x:' '.join(x.split()[:1]))
df_new['Model']=df_new['Name'].apply(lambda x:' '.join(x.split()[1:2]))
df_new['Variant']=df_new['Name'].apply(lambda x:' '.join(x.split()[2:]))
df_new['Name']=df_new['Name'].apply(lambda x:' '.join(x.lower() for x in x.split()))
df_new['Brand']=df_new['Brand'].apply(lambda x:' '.join(x.lower() for x in x.split()))
df_new['Model']=df_new['Model'].apply(lambda x:' '.join(x.lower() for x in x.split()))
df_new['Variant']=df_new['Variant'].apply(lambda x:' '.join(x.lower() for x in x.split()))
df_new.head()

,Name,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,New_Price,Price,Brand,Model,Variant
0,maruti wagon r lxi cng,Mumbai,2010,72000,CNG,Manual,First,26.60,998.0,58.16,5.0,NaN,1.75,maruti,wagon,r lxi cng
1,hyundai creta 1.6 crdi sx option,Pune,2015,41000,Diesel,Manual,First,19.67,1582.0,126.20,5.0,NaN,12.50,hyundai,creta,1.6 crdi sx option
2,honda jazz v,Chennai,2011,46000,Petrol,Manual,First,18.20,1199.0,88.70,5.0,8.61 Lakh,4.50,honda,jazz,v
3,maruti ertiga vdi,Chennai,2012,87000,Diesel,Manual,First,20.77,1248.0,88.76,7.0,NaN,6.00,maruti,ertiga,vdi
4,audi a4 new 2.0 tdi multitronic,Coimbatore,2013,40670,Diesel,Automatic,Second,15.20,1968.0,140.80,5.0,NaN,17.74,audi,a4,new 2.0 tdi multitronic

In [ ]:
df_new.groupby(by='Brand')['Mileage'].mean()

Brand
ambassador       12.800000
audi             15.126620
bmw              16.976899
chevrolet        18.422987
datsun           21.298000
fiat             18.341176
ford             18.498471
honda            18.366272
hyundai          18.529231
isuzu            13.800000
jaguar           14.955769
jeep             16.709091
land             11.521875
mahindra         15.178466
maruti           21.408310
mercedes-benz    14.152486
mini             18.863636
mitsubishi       11.666429
nissan           19.474038
porsche          12.934167
renault          20.265250
skoda            16.630103
smart             0.000000
tata             19.931802
toyota           14.273143
volkswagen       18.337052
volvo            15.448462
Name: Mileage, dtype: float64

In [ ]:
df_new.isnull().sum()

Name                    0
Location                0
Year                    0
Kilometers_Driven       0
Fuel_Type               0
Transmission            0
Owner_Type              0
Mileage                 0
Engine                 22
Power                  87
Seats                  25
New_Price            3018
Price                   0
Brand                   0
Model                   0
Variant                 0
dtype: int64

In [ ]:
brand_list=df_new.Brand.unique().tolist()

In [ ]:
for i in brand_list:
    df_new.Engine[(df_new.Engine.isnull()) & (df_new['Brand']==i)]= df_new.Engine[(df_new.Engine.notnull()) & (df_new['Brand']==i)].mean()
    df_new.Power[(df_new.Power.isnull()) & (df_new['Brand']==i)]= df_new.Power[(df_new.Power.notnull()) & (df_new['Brand']==i)].mean()

df_new.Seats[df_new.Seats.isnull()]=int(df_new.Seats[df_new.Seats.notnull()].mean())

<ipython-input-108-b080d0bb9b49>:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_new.Engine[(df_new.Engine.isnull()) & (df_new['Brand']==i)]= df_new.Engine[(df_new.Engine.notnull()) & (df_new['Brand']==i)].mean()
<ipython-input-108-b080d0bb9b49>:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_new.Power[(df_new.Power.isnull()) & (df_new['Brand']==i)]= df_new.Power[(df_new.Power.notnull()) & (df_new['Brand']==i)].mean()
<ipython-input-108-b080d0bb9b49>:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_new.Seats[df_new.Seats.isnull()]=int(df_new.Seats[df_new.Seats.notnull()].mean())

In [ ]:
df_new.isnull().sum()

Name                    0
Location                0
Year                    0
Kilometers_Driven       0
Fuel_Type               0
Transmission            0
Owner_Type              0
Mileage                 0
Engine                  0
Power                   1
Seats                   0
New_Price            3018
Price                   0
Brand                   0
Model                   0
Variant                 0
dtype: int64

In [ ]:
df_new.Power[(df_new.Power.isnull())]= df_new.Power[(df_new.Power.notnull())].mean()

<ipython-input-110-3b979cba71c8>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_new.Power[(df_new.Power.isnull())]= df_new.Power[(df_new.Power.notnull())].mean()

In [ ]:
df_new.isnull().sum()

Name                    0
Location                0
Year                    0
Kilometers_Driven       0
Fuel_Type               0
Transmission            0
Owner_Type              0
Mileage                 0
Engine                  0
Power                   0
Seats                   0
New_Price            3018
Price                   0
Brand                   0
Model                   0
Variant                 0
dtype: int64

In [ ]:
df_new[df_new['Brand']=='smart']

,Name,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,New_Price,Price,Brand,Model,Variant
915,smart fortwo cdi at,Pune,2008,103000,Diesel,Automatic,Second,0.0,799.0,NaN,2.0,NaN,3.0,smart,fortwo,cdi at

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3499 entries, 0 to 3498
Data columns (total 13 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Name               3499 non-null   object
 1   Location           3499 non-null   object
 2   Year               3499 non-null   int64
 3   Kilometers_Driven  3499 non-null   int64
 4   Fuel_Type          3499 non-null   object
 5   Transmission       3499 non-null   object
 6   Owner_Type         3499 non-null   object
 7   Mileage            3499 non-null   object
 8   Engine             3477 non-null   object
 9   Power              3477 non-null   object
 10  Seats              3474 non-null   float64
 11  New_Price          481 non-null    object
 12  Price              3499 non-null   float64
dtypes: float64(2), int64(2), object(9)
memory usage: 355.5+ KB

In [ ]:
df_new['New_Price1']= df_new['New_Price'].apply(lambda x: float(str(x).replace(' Lakh','')) if (str(x).find('Lakh'))!=-1 else (float(str(x).replace(' Cr',''))*100 if (str(x).find('Cr'))!=-1 else 'Nan'))

In [ ]:
df_new.New_Price1[df_new.New_Price1=='Nan']=np.nan

<ipython-input-120-2e33fb6de519>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_new.New_Price1[df_new.New_Price1=='Nan']=np.nan

In [ ]:
df_new['New_Price1']=pd.to_numeric(df_new['New_Price1'])

In [ ]:
df_new.head()

,Name,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,New_Price,Price,Brand,Model,Variant,New_Price1
0,maruti wagon r lxi cng,Mumbai,2010,72000,CNG,Manual,First,26.60,998.0,58.16,5.0,NaN,1.75,maruti,wagon,r lxi cng,NaN
1,hyundai creta 1.6 crdi sx option,Pune,2015,41000,Diesel,Manual,First,19.67,1582.0,126.20,5.0,NaN,12.50,hyundai,creta,1.6 crdi sx option,NaN
2,honda jazz v,Chennai,2011,46000,Petrol,Manual,First,18.20,1199.0,88.70,5.0,8.61 Lakh,4.50,honda,jazz,v,8.61
3,maruti ertiga vdi,Chennai,2012,87000,Diesel,Manual,First,20.77,1248.0,88.76,7.0,NaN,6.00,maruti,ertiga,vdi,NaN
4,audi a4 new 2.0 tdi multitronic,Coimbatore,2013,40670,Diesel,Automatic,Second,15.20,1968.0,140.80,5.0,NaN,17.74,audi,a4,new 2.0 tdi multitronic,NaN

In [ ]:
df_new2=df_new.copy()

In [ ]:
model_list=df_new.Model.unique().tolist()

In [ ]:
model_brand=[]
for i in range(0,df_new.shape[0]):
    if (df_new.loc[i,'Model'],df_new.loc[i,'Brand']) not in model_brand:
        model_brand.append((df_new.loc[i,'Model'],df_new.loc[i,'Brand']))

In [ ]:
model_brand

In [ ]:
for i in model_brand:
    df_new2.New_Price1[(df_new2.New_Price1.isnull()) & (df_new2['Model']==i[0]) & (df_new2['Brand']==i[1])]= df_new2.New_Price1[(df_new2.New_Price1.notnull()) & (df_new2['Model']==i[0])& (df_new2['Brand']==i[1])].mean()
df_new2.isnull().sum()

<ipython-input-128-274308ffc546>:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_new2.New_Price1[(df_new2.New_Price1.isnull()) & (df_new2['Model']==i[0]) & (df_new2['Brand']==i[1])]= df_new2.New_Price1[(df_new2.New_Price1.notnull()) & (df_new2['Model']==i[0])& (df_new2['Brand']==i[1])].mean()

Name                    0
Location                0
Year                    0
Kilometers_Driven       0
Fuel_Type               0
Transmission            0
Owner_Type              0
Mileage                 0
Engine                  0
Power                   0
Seats                   0
New_Price            3018
Price                   0
Brand                   0
Model                   0
Variant                 0
New_Price1            831
dtype: int64

In [ ]:
for i in brand_list:
    df_new2.New_Price1[(df_new2.New_Price1.isnull()) & (df_new2['Brand']==i)] = df_new2.New_Price1[(df_new2.New_Price1.notnull()) & (df_new2['Brand']==i)].mean()
df_new2.isnull().sum()

<ipython-input-129-4f9430bb5f2e>:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_new2.New_Price1[(df_new2.New_Price1.isnull()) & (df_new2['Brand']==i)] = df_new2.New_Price1[(df_new2.New_Price1.notnull()) & (df_new2['Brand']==i)].mean()

Name                    0
Location                0
Year                    0
Kilometers_Driven       0
Fuel_Type               0
Transmission            0
Owner_Type              0
Mileage                 0
Engine                  0
Power                   0
Seats                   0
New_Price            3018
Price                   0
Brand                   0
Model                   0
Variant                 0
New_Price1             79
dtype: int64

In [ ]:
drop_p=df_new2[df_new2.Price>df_new2.New_Price1].index

In [ ]:
df_new2.drop(drop_p,axis=0,inplace=True)

In [ ]:
df_new2[df_new2.New_Price1.isnull()==True].index

Int64Index([ 145,  179,  183,  231,  240,  354,  441,  502,  522,  543,  581,
             612,  646,  699,  720,  753,  767,  770,  779,  820,  915,  961,
             977, 1025, 1026, 1060, 1087, 1221, 1229, 1285, 1366, 1422, 1428,
            1454, 1463, 1480, 1506, 1555, 1604, 1612, 1643, 1656, 1727, 1763,
            1831, 1837, 1849, 1858, 1871, 1881, 1922, 2071, 2077, 2214, 2312,
            2327, 2349, 2444, 2479, 2548, 2575, 2616, 2630, 2760, 2771, 2830,
            2856, 2865, 2981, 3086, 3166, 3170, 3294, 3331, 3355, 3436, 3473,
            3482, 3485],
           dtype='int64')

In [ ]:
df_new3=df_new2.copy()

In [ ]:
df_new2.drop([ 145,  179,  183,  231,  240,  354,  441,  502,  522,  543,  581,
             612,  646,  699,  720,  753,  767,  770,  779,  820,  915,  961,
             977, 1025, 1026, 1060, 1087, 1221, 1229, 1285, 1366, 1422, 1428,
            1454, 1463, 1480, 1506, 1555, 1604, 1612, 1643, 1656, 1727, 1763,
            1831, 1837, 1849, 1858, 1871, 1881, 1922, 2071, 2077, 2214, 2312,
            2327, 2349, 2444, 2479, 2548, 2575, 2616, 2630, 2760, 2771, 2830,
            2856, 2865, 2981, 3086, 3166, 3170, 3294, 3331, 3355, 3436, 3473,
            3482, 3485],axis=0,inplace=True)
df_new2.isnull().sum()

Name                    0
Location                0
Year                    0
Kilometers_Driven       0
Fuel_Type               0
Transmission            0
Owner_Type              0
Mileage                 0
Engine                  0
Power                   0
Seats                   0
New_Price            2897
Price                   0
Brand                   0
Model                   0
Variant                 0
New_Price1              0
dtype: int64

In [ ]:
df_new2.shape

(3378, 17)

In [ ]:
df_new2.to_csv('train-new-car-dataset.csv')